Documents/удалить_ИА_НастройкаФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>удалить_ИА_НастройкаФП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСтатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникНастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникХранилищеЗапросаКонстурктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределенияПервичная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыраженияЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпискиЗначенийПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ИА_РежимРасчетаСуммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_РежимРасчетаСуммы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВычисляемоеВыражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ВариантыПолученияДанныхВидыДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыПолученияДанныхВидыДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВычисляемоеВыражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвиженияДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/удалить_ИА_НастройкаФП/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьЗначениеПоУмолчаниюВЗначение(НСтрока, начальноеЗаполнение = Ложь,ИмяТаб)
	ОбъектЗн = РеквизитФормыВЗначение("Объект");
	Если ИмяТаб = "ПолитикаРаспределения" Тогда
		пСтрока = ОбъектЗн.ПолитикаРаспределения[НСтрока];
	Иначе
		пСтрока = ОбъектЗн.ПолитикаРаспределенияПервичная[НСтрока];
	КонецЕсли;
	Если пстрока.РежимРасчета = Перечисления.ИА_РежимРасчетаСуммы.Процент Тогда
		Если начальноеЗаполнение тогда			
			Если не ЗначениеЗаполнено(пстрока.Значение) Тогда
				пстрока.Значение = 0;
			КонецЕсли;
			Если не ЗначениеЗаполнено(пстрока.ЗначениеБезнал) Тогда
				пстрока.ЗначениеБезнал = 0;
			КонецЕсли;
		Иначе
			пстрока.Значение = 0;
			пстрока.ЗначениеБезнал = 0;
		КонецЕсли;
	ИначеЕсли пстрока.РежимРасчета = Перечисления.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение Тогда
		Если начальноеЗаполнение тогда			
			Если не ЗначениеЗаполнено(пстрока.Значение) Тогда
				пстрока.Значение = "";
			КонецЕсли;
			Если не ЗначениеЗаполнено(пстрока.ЗначениеБезнал) Тогда
				пстрока.ЗначениеБезнал = "";
			КонецЕсли;
		Иначе
			пстрока.Значение = "";
			пстрока.ЗначениеБезнал = "";
		КонецЕсли;
	ИначеЕсли пстрока.РежимРасчета = Перечисления.ИА_РежимРасчетаСуммы.ФиксированнаяСумма Тогда
		Если начальноеЗаполнение тогда			
			Если не ЗначениеЗаполнено(пстрока.Значение) Тогда
				пстрока.Значение = 0;
			КонецЕсли;
			Если не ЗначениеЗаполнено(пстрока.ЗначениеБезнал) Тогда
				пстрока.ЗначениеБезнал = 0;
			КонецЕсли;
		Иначе
			пстрока.Значение = 0;
			пстрока.ЗначениеБезнал = 0;
		КонецЕсли;
	ИначеЕсли пстрока.РежимРасчета = Перечисления.ИА_РежимРасчетаСуммы.РучнойВвод Тогда
		Если начальноеЗаполнение тогда			
			Если не ЗначениеЗаполнено(пстрока.Значение) Тогда
				пстрока.Значение = 0;
			КонецЕсли;
			Если не ЗначениеЗаполнено(пстрока.ЗначениеБезнал) Тогда
				пстрока.ЗначениеБезнал = 0;
			КонецЕсли;
		Иначе
			пстрока.Значение = 0;
			пстрока.ЗначениеБезнал = 0;
		КонецЕсли;
	КонецЕсли;
	ЗначениеВРеквизитФормы(ОбъектЗн,"Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПоНалБезнал()
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ФППоОрганизациям ТОгда
			Объект.Организация = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ОсновнаяОрганизация);
		КонецЕсли;
    КонецЕсли;

	
	ИА_РежимРасчетаСуммыВычисляемоеВыражение = Перечисления.ИА_РежимРасчетаСуммы.ВычисляемоеВыражение;
	ОбновитьОтображениеПоНалБезнал();
	
	Для каждого стр из Объект.ПолитикаРаспределения Цикл
		УстановитьЗначениеПоУмолчаниюВЗначение(стр.НомерСтроки-1,истина,"ПолитикаРаспределения");
	КонецЦикла;
	
	Для каждого стр из Объект.ПолитикаРаспределенияПервичная Цикл
		УстановитьЗначениеПоУмолчаниюВЗначение(стр.НомерСтроки-1,истина,"ПолитикаРаспределенияПервичная");
	КонецЦикла;
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Элементы.Организация.Видимость = ФППоОрганизациям;
	Модифицированность = Ложь;
	
	Элементы.ПолитикаРаспределения.ПодчиненныеЭлементы.ПолитикаРаспределенияЗначениеНал.Видимость = РазделятьНалБезнал;
	Элементы.ПолитикаРаспределения.ПодчиненныеЭлементы.ПолитикаРаспределенияЗначениеБезнал.Видимость = РазделятьНалБезнал;
	Элементы.ПолитикаРаспределения.ПодчиненныеЭлементы.ПолитикаРаспределенияЗначение.Видимость = не РазделятьНалБезнал;
	
	Элементы.ПолитикаРаспределенияПервичная.ПодчиненныеЭлементы.ПолитикаРаспределенияПервичнаяЗначениеНал.Видимость = РазделятьНалБезнал;
	Элементы.ПолитикаРаспределенияПервичная.ПодчиненныеЭлементы.ПолитикаРаспределенияПервичнаяЗначениеБезнал.Видимость = РазделятьНалБезнал;
	Элементы.ПолитикаРаспределенияПервичная.ПодчиненныеЭлементы.ПолитикаРаспределенияПервичнаяЗначение.Видимость = не РазделятьНалБезнал; 	
	
	УстановитьДоступностьЭлементов();
	ВосстановитьНастройкиСервер(КомпоновщикНастроек); 
	
КонецПроцедуры

&НаСервере
Функция ВосстановитьНастройкиСервер(КомпоновщикНастроек)

	Об = РеквизитФормыВЗначение("Объект");
	Об.ВосстановитьНастройки(КомпоновщикНастроек);
	
КонецФункции // ВосстановитьНастройкиСервер()


&НаКлиенте
Процедура ПолитикаРаспределенияРежимРасчетаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьЗначениеПоУмолчаниюВЗначение(Элементы.ПолитикаРаспределения.ТекущиеДанные.НомерСтроки - 1,Ложь,"ПолитикаРаспределения");
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаРаспределенияЗначениеНалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	тд =  Этаформа.ТекущийЭлемент.ТекущиеДанные;
	Если тд.РежимРасчета = ИА_РежимРасчетаСуммыВычисляемоеВыражение Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Необходимо записать документ. Записать?", Режим, 0);
			Если Ответ=КодВозвратаДиалога.Да Тогда
				Записать();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		фРед = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.КонструкторВыраженияУпр",,ЭтаФорма);
		фРед.ВыбПодразделение = тд.Подразделение; 
		фРед.ВыбФонд = тд.Фонд;
		фРед.Выбраздел = тд.Раздел;
		фРед.ИмяЗаполняемогоПоля = "Значение";
		фРед.Организация = Объект.Организация;                 
		фРед.ДокНастройки = Объект.Ссылка;                 
		фРед.ПолеФормула = Элемент.ТекстРедактирования;
		фРед.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаРаспределенияПервичнаяРежимРасчетаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьЗначениеПоУмолчаниюВЗначение(Элементы.ПолитикаРаспределенияПервичная.ТекущиеДанные.НомерСтроки - 1,Ложь,"ПолитикаРаспределенияПервичная");
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаРаспределенияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	тд =  Этаформа.ТекущийЭлемент.ТекущиеДанные;
	Если тд.РежимРасчета  = ИА_РежимРасчетаСуммыВычисляемоеВыражение Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Необходимо записать документ. Записать?", Режим, 0);
			Если Ответ=КодВозвратаДиалога.Да Тогда
				Записать();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		фРед = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.КонструкторВыраженияУпр",,ЭтаФорма);
		фРед.ВыбПодразделение = тд.Подразделение; 
		фРед.ВыбФонд = тд.Фонд; 
		фРед.Выбраздел = тд.Раздел;
		фРед.ЭтоБезнал = истина;
		фРед.ИмяЗаполняемогоПоля = "ЗначениеБезнал";
		фРед.Организация = Объект.Организация;
		фРед.ДокНастройки = Объект.Ссылка;                 
		фРед.ПолеФормула = Элемент.ТекстРедактирования;
		фРед.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаРаспределенияЗначениеБезналНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	тд =  Этаформа.ТекущийЭлемент.ТекущиеДанные;
	Если тд.РежимРасчета  = ИА_РежимРасчетаСуммыВычисляемоеВыражение Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Необходимо записать документ. Записать?", Режим, 0);
			Если Ответ=КодВозвратаДиалога.Да Тогда
				Записать();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		фРед = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.КонструкторВыраженияУпр",,ЭтаФорма);
		фРед.ВыбПодразделение = тд.Подразделение; 
		фРед.ВыбФонд = тд.Фонд;
		фРед.Выбраздел = тд.Раздел;
		фРед.ЭтоБезнал = истина;
		фРед.ИмяЗаполняемогоПоля = "ЗначениеБезнал";
		фРед.Организация = Объект.Организация;
		фРед.ДокНастройки = Объект.Ссылка;                 
		фРед.ПолеФормула = Элемент.ТекстРедактирования;
		фРед.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаРаспределенияПервичнаяЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	тд =  Этаформа.ТекущийЭлемент.ТекущиеДанные;
	Если тд.РежимРасчета  = ИА_РежимРасчетаСуммыВычисляемоеВыражение Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Необходимо записать документ. Записать?", Режим, 0);
			Если Ответ=КодВозвратаДиалога.Да Тогда
				Записать();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		фРед = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.КонструкторВыраженияУпр",,ЭтаФорма);
		фРед.ВыбПодразделение = тд.Подразделение; 
		фРед.ВыбФонд = тд.Фонд; 
		фРед.Выбраздел = тд.Раздел;
		фРед.ЭтоБезнал = истина;
		фРед.ИмяЗаполняемогоПоля = "ЗначениеБезнал";
		фРед.Организация = Объект.Организация;
		фРед.ДокНастройки = Объект.Ссылка;                 
		фРед.ПолеФормула = Элемент.ТекстРедактирования;
		фРед.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаРаспределенияПервичнаяЗначениеБезналНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	тд =  Этаформа.ТекущийЭлемент.ТекущиеДанные;
	Если тд.РежимРасчета  = ИА_РежимРасчетаСуммыВычисляемоеВыражение Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Необходимо записать документ. Записать?", Режим, 0);
			Если Ответ=КодВозвратаДиалога.Да Тогда
				Записать();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		фРед = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.КонструкторВыраженияУпр",,ЭтаФорма);
		фРед.ВыбПодразделение = тд.Подразделение; 
		фРед.ВыбФонд = тд.Фонд; 
		фРед.Выбраздел = тд.Раздел;
		фРед.ЭтоБезнал = истина;
		фРед.ИмяЗаполняемогоПоля = "ЗначениеБезнал";
		фРед.Организация = Объект.Организация;
		фРед.ДокНастройки = Объект.Ссылка;                 
		фРед.ПолеФормула = Элемент.ТекстРедактирования;
		фРед.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаРаспределенияПервичнаяЗначениеНалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	тд =  Этаформа.ТекущийЭлемент.ТекущиеДанные;
	Если тд.РежимРасчета  = ИА_РежимРасчетаСуммыВычисляемоеВыражение Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Необходимо записать документ. Записать?", Режим, 0);
			Если Ответ=КодВозвратаДиалога.Да Тогда
				Записать();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		фРед = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.КонструкторВыраженияУпр",,ЭтаФорма);
		фРед.ВыбПодразделение = тд.Подразделение; 
		фРед.ВыбФонд = тд.Фонд; 
		фРед.Выбраздел = тд.Раздел;
		фРед.ИмяЗаполняемогоПоля = "Значение";
		фРед.Организация = Объект.Организация;
		фРед.ДокНастройки = Объект.Ссылка;                 
		фРед.ПолеФормула = Элемент.ТекстРедактирования;
		фРед.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗначенийПараметра(ВидДохода, Параметр, ЗначенияПараметров, КлючСписка, ТипОплаты)
	
	ВременнаяТаблица = Объект.СпискиЗначенийПараметров.Выгрузить();
	Объект.СпискиЗначенийПараметров.Очистить();
	Для Каждого ТекСтрока Из ВременнаяТаблица Цикл
		Если НЕ (ТекСтрока.ВидДохода = ВидДохода 
			И ТекСтрока.Параметр = Параметр 
			И ТекСтрока.ТипОплаты = ТипОплаты
			И ТекСтрока.КлючСписка = КлючСписка) Тогда
			НоваяСтрока = Объект.СпискиЗначенийПараметров.Добавить();
			НоваяСтрока.ВидДохода	 = ТекСтрока.ВидДохода;
			НоваяСтрока.Параметр	 = ТекСтрока.Параметр;
			НоваяСтрока.Значение	 = ТекСтрока.Значение;
			НоваяСтрока.КлючСписка	 = ТекСтрока.КлючСписка;
			НоваяСтрока.ТипОплаты	 = ?(ЗначениеЗаполнено(ТекСтрока.ТипОплаты), ТекСтрока.ТипОплаты, ТипОплаты);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначенияПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого ТекЗначение Из ЗначенияПараметров Цикл
		НоваяСтрока = Объект.СпискиЗначенийПараметров.Добавить();
		НоваяСтрока.ВидДохода	 = ВидДохода;
		НоваяСтрока.Параметр	 = Параметр;
		НоваяСтрока.Значение	 = ТекЗначение.Значение;
		НоваяСтрока.КлючСписка	 = КлючСписка;
		НоваяСтрока.ТипОплаты	 = ТипОплаты;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначенийПараметра(ВидДохода, Параметр, ТипОплаты, КлючСписка)
	//ИА_20160304
	СписокПараметров = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из Объект.СпискиЗначенийПараметров Цикл
		Если ТекСтрока.ВидДохода = ВидДохода 
			И ТекСтрока.Параметр = Параметр
			И (ТекСтрока.ТипОплаты = ТипОплаты ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.ТипОплаты))
			И ТекСтрока.КлючСписка = КлючСписка Тогда
			СписокПараметров.Добавить(ТекСтрока.Значение);			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокПараметров;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = ПечатьНастройкиНаСервере();
	ТабДок.Показать();;
КонецПроцедуры

&НаСервере
Функция ПечатьНастройкиНаСервере()
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПолитикаФП");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	
	ОбластьШапка1 			= Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2 			= Макет.ПолучитьОбласть("Шапка2");
	ОбластьСтрокаВидДохода	= Макет.ПолучитьОбласть("СтрокаВидДохода");
	ОбластьСтрокаТаб2 		= Макет.ПолучитьОбласть("СтрокаТаб2");		
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ОбластьШапка1.Параметры.Заголовок = "Политика по распределению денежных средств";
	ОбластьШапка1.Параметры.Организация  = Объект.Организация;
	ОбластьШапка1.Параметры.Дата 		= Объект.Дата;
	ТабДок.Вывести(ОбластьШапка1);
	
	Для каждого Строка Из Объект.Доходы Цикл
		ОбластьСтрокаВидДохода.Параметры.Номер 					= Строка.НомерСтроки;
		ОбластьСтрокаВидДохода.Параметры.ВидДохода              = Строка.ВидДохода;
		ОбластьСтрокаВидДохода.Параметры.ВариантПолученияДанных = Строка.ВидПолученияДанных;	
		Если Строка.ВидПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос Тогда
			ОбластьСтрокаВидДохода.Параметры.Значение               = "<Запрос>";
		ИначеЕсли Строка.ВидПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.ДвиженияДС Тогда
			ОбластьСтрокаВидДохода.Параметры.Значение               = Строка.ТекстВыраженияЗапросаБезнал;
		ИначеЕсли Строка.ВидПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную Тогда
			ОбластьСтрокаВидДохода.Параметры.Значение               = "";
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтрокаВидДохода);
	КонецЦикла;
	
	ОбластьШапка2.Параметры.НазваниеТаблицы = "Статьи расходов, на которые будет распределяться сумма к распределению:";
	ТабДок.Вывести(ОбластьШапка2);
	
	Для каждого Строка Из Объект.ПолитикаРаспределенияПервичная Цикл
		ОбластьСтрокаТаб2.Параметры.Раздел 					= Строка.Раздел;
		ОбластьСтрокаТаб2.Параметры.Подразделение          	= Строка.Подразделение;
		ОбластьСтрокаТаб2.Параметры.Фонд 					= Строка.Фонд;	
		ОбластьСтрокаТаб2.Параметры.РежимРасчета           	= Строка.РежимРасчета;
		ОбластьСтрокаТаб2.Параметры.Наличные               	= Строка.Значение;
		ОбластьСтрокаТаб2.Параметры.Значение               	= Строка.ЗначениеБезнал;
		ОбластьСтрокаТаб2.Параметры.ПроцентРаздела         	= Строка.ПроцентОтИтогаРаздела;
		ОбластьСтрокаТаб2.Параметры.Комментарий            	= Строка.Комментарий;
		ТабДок.Вывести(ОбластьСтрокаТаб2);
	КонецЦикла;
	
	ОбластьШапка2.Параметры.НазваниеТаблицы = "Статьи расходов, на которые будет распределяться маржинальная прибыль:";
	ТабДок.Вывести(ОбластьШапка2);
	
	Для каждого Строка Из Объект.ПолитикаРаспределения Цикл
		ОбластьСтрокаТаб2.Параметры.Раздел 					= Строка.Раздел;
		ОбластьСтрокаТаб2.Параметры.Подразделение          	= Строка.Подразделение;
		ОбластьСтрокаТаб2.Параметры.Фонд 					= Строка.Фонд;	
		ОбластьСтрокаТаб2.Параметры.РежимРасчета           	= Строка.РежимРасчета;
		ОбластьСтрокаТаб2.Параметры.Наличные               	= Строка.Значение;
		ОбластьСтрокаТаб2.Параметры.Значение               	= Строка.ЗначениеБезнал;
		ОбластьСтрокаТаб2.Параметры.ПроцентРаздела         	= Строка.ПроцентОтИтогаРаздела;
		ОбластьСтрокаТаб2.Параметры.Комментарий            	= Строка.Комментарий;
		ТабДок.Вывести(ОбластьСтрокаТаб2);
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);	
	
	
	Возврат ТабДок;	
	
КонецФункции


&НаКлиенте
Процедура ВидПолученияДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрокаДоходов  =  Элемент.Родитель.ТекущиеДанные;
	
	Если ТекущаяСтрокаДоходов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидПолученияДанных    = Этаформа.ТекущийЭлемент.ТекущиеДанные.ВидПолученияДанных;
	
	Если ВидПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Вручную") Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Если Вопрос("Необходимо записать документ. Записать?", Режим, 0) = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	ВидДохода             = ТекущаяСтрокаДоходов.ВидДохода;	
	Парам = Новый Структура;
	Парам.Вставить("ИмяРегистраБезнал", ТекущаяСтрокаДоходов.ИмяРегистраБезнал);
	Парам.Вставить("ПредставлениеРегистраБезнал", ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаБезнал);
	Парам.Вставить("РесурсРегистраБезнал", ТекущаяСтрокаДоходов.РесурсРегистраБезНал);
	Парам.Вставить("ПолеСтатьяДДСБезнал", ТекущаяСтрокаДоходов.ПолеСтатьяДДСБезнал);
	
	Парам.Вставить("ИмяРегистраНал", ТекущаяСтрокаДоходов.ИмяРегистраНал);
	Парам.Вставить("ПредставлениеРегистраНал", ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаНал);
	Парам.Вставить("РесурсРегистраНал", ТекущаяСтрокаДоходов.РесурсРегистраНал);
	Парам.Вставить("ПолеСтатьяДДСНал", ТекущаяСтрокаДоходов.ПолеСтатьяДДСНал);
	
	ФормаКонструктора = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.КонструкторВидДоходаУпр",Парам);
	
	ФормаКонструктора.РежимКонструктора  = ВидПолученияДанных;
	ФормаКонструктора.РазделятьНалБезнал = РазделятьНалБезнал;
	
	Если ВидПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.ДвиженияДС") Тогда
		
		//ФормаКонструктора.ИмяРегистраБезнал           = ТекущаяСтрокаДоходов.ИмяРегистраБезнал;
		//ФормаКонструктора.ПредставлениеРегистраБезнал = ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаБезнал;
		//ФормаКонструктора.РесурсРегистраБезнал        = ТекущаяСтрокаДоходов.РесурсРегистраБезНал;
		//ФормаКонструктора.ПолеСтатьяДДСБезнал         = ТекущаяСтрокаДоходов.ПолеСтатьяДДСБезнал;
		
		//ФормаКонструктора.ИмяРегистраНал              = ТекущаяСтрокаДоходов.ИмяРегистраНал;
		//ФормаКонструктора.ПредставлениеРегистраНал    = ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаНал;
		//ФормаКонструктора.РесурсРегистраНал           = ТекущаяСтрокаДоходов.РесурсРегистраНал;
		//ФормаКонструктора.ПолеСтатьяДДСНал 
		
		Для каждого ТекСтрокаПараметров из Объект.ПараметрыВыраженияЗапроса Цикл
			
			Если НЕ ТекСтрокаПараметров.ВидДохода = ВидДохода Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ТекСтрокаПараметров.ВидПолученияДанных = ВидПолученияДанных Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСтрокаПараметров.ТипОплаты = ПредопределенноеЗначение("Перечисление.ИА_ТипДвиженияДенежныхСредств.Безналичные") Тогда
				НоваяСрокаПараметров = ФормаКонструктора.ПараметрыДвиженияДСБезнал.Добавить();
			Иначе
				НоваяСрокаПараметров = ФормаКонструктора.ПараметрыДвиженияДСНал.Добавить();
			КонецЕсли;
			
			НоваяСрокаПараметров.Параметр 		    = ТекСтрокаПараметров.Параметр;
			
			Если Найти(ВРЕГ(ТекСтрокаПараметров.ТипСравнения),"СПИСКЕ")>0 Тогда
				//ИА_20160304
				НоваяСрокаПараметров.Значение 		= ПолучитьСписокЗначенийПараметра(ВидДохода, ТекСтрокаПараметров.Параметр, ТекСтрокаПараметров.ТипОплаты, ТекСтрокаПараметров.КлючСписка);
			Иначе	
				НоваяСрокаПараметров.Значение 		= ТекСтрокаПараметров.Значение;
			КонецЕсли;
			
			НоваяСрокаПараметров.ТипСравнения    	= ОпределитьТипСравнения(ТекСтрокаПараметров.ТипСравнения);
			
		КонецЦикла;
		
		
	ИначеЕсли ВидПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос") Тогда
		
		
		ФормаКонструктора.ТекстЗапросаБезнал = ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаБезнал;
		ФормаКонструктора.ТекстЗапросаНал    = ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаНал;
		
		Для каждого ТекСтрокаПараметров из Объект.ПараметрыВыраженияЗапроса Цикл
			
			Если НЕ ТекСтрокаПараметров.ВидДохода = ВидДохода Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ТекСтрокаПараметров.ВидПолученияДанных = ВидПолученияДанных Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСтрокаПараметров.ТипОплаты = ПредопределенноеЗначение("Перечисление.ИА_ТипДвиженияДенежныхСредств.Безналичные") Тогда
				НоваяСрокаПараметров = ФормаКонструктора.ПараметрыЗапросаБезнал.Добавить();
			Иначе
				НоваяСрокаПараметров = ФормаКонструктора.ПараметрыЗапросаНал.Добавить();
			КонецЕсли;
			
			НоваяСрокаПараметров.Параметр 		    = ТекСтрокаПараметров.Параметр;
			
			Если Найти(ВРЕГ(ТекСтрокаПараметров.ТипСравнения),"СПИСКЕ")>0 Тогда
				//ИА_20160304
				НоваяСрокаПараметров.Значение 		= ПолучитьСписокЗначенийПараметра(ВидДохода, ТекСтрокаПараметров.Параметр, ТекСтрокаПараметров.ТипОплаты, ТекСтрокаПараметров.КлючСписка)
			Иначе	
				НоваяСрокаПараметров.Значение 		= ТекСтрокаПараметров.Значение;
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЕсли;
	
	Результат = ФормаКонструктора.ОткрытьМодально(); 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТекущаяСтрокаДоходов.ВидПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос") Тогда	
		ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаБезнал = СокрЛП(Результат.ТекстЗапросаБезнал);
		ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаНал    = СокрЛП(Результат.ТекстЗапросаНал);
	Иначе	
		ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаБезнал = СокрЛП(Результат.ПредставлениеРегистраБезнал);
		ТекущаяСтрокаДоходов.ТекстВыраженияЗапросаНал    = СокрЛП(Результат.ПредставлениеРегистраНал);
		ТекущаяСтрокаДоходов.ИмяРегистраБезнал           = Результат.ИмяРегистраБезнал;	
		ТекущаяСтрокаДоходов.РесурсРегистраБезНал        = Результат.РесурсРегистраБезнал;
		ТекущаяСтрокаДоходов.ИмяРегистраНал		         = Результат.ИмяРегистраНал; 
		ТекущаяСтрокаДоходов.РесурсРегистраНал   		 = Результат.РесурсРегистраНал;  
		ТекущаяСтрокаДоходов.ПолеСтатьяДДСБезнал   		 = Результат.ПолеСтатьяДДСБезнал;  
		ТекущаяСтрокаДоходов.ПолеСтатьяДДСНал   		 = Результат.ПолеСтатьяДДСНал;  
	КонецЕсли;
	
	ВременнаяПараметрыВыраженияЗапроса.Очистить();
	Для каждого СтрокаПараметров из Объект.ПараметрыВыраженияЗапроса Цикл
		СтрокаВременныхПараметров = ВременнаяПараметрыВыраженияЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВременныхПараметров,СтрокаПараметров);
	КонецЦикла; 
	
	Объект.ПараметрыВыраженияЗапроса.Очистить();        	
	Для Каждого ТекСтрока Из ВременнаяПараметрыВыраженияЗапроса Цикл
		
		Если  ТекСтрока.ВидДохода = ВидДохода И
			ТекСтрока.ВидПолученияДанных = ВидПолученияДанных  Тогда
			Продолжить;
		КонецЕсли;
		
		//ИА_20160304
		НоваяСтрока = Объект.ПараметрыВыраженияЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
				
	КонецЦикла;
	
	КлючСписка = 0;
	
	//ИА_20160304
	//Удаляем все строки тек. вида дохода чтобы дальше актуально их заполнить
	Кол = Объект.СпискиЗначенийПараметров.Количество();
	СпискиЗначений = Объект.СпискиЗначенийПараметров;
	Для Сч = 1 По Кол Цикл
		Стр = СпискиЗначений[Кол - Сч];
		Если Стр.ВидДохода = ВидДохода Тогда 
			СпискиЗначений.Удалить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекСтрокаБезнал из Результат.ПараметрыЗапросаБезнал Цикл
		
		КлючСписка = КлючСписка + 1;
		НоваяСтрока = Объект.ПараметрыВыраженияЗапроса.Добавить();
		НоваяСтрока.ВидДохода          = ВидДохода;
		НоваяСтрока.ТипОплаты          = ПредопределенноеЗначение("Перечисление.ИА_ТипДвиженияДенежныхСредств.Безналичные");
		НоваяСтрока.ВидПолученияДанных = ВидПолученияДанных;
		НоваяСтрока.Параметр           = ТекСтрокаБезнал.Параметр;
		
		Если НЕ ТекущаяСтрокаДоходов.ВидПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос") Тогда	
			Если Найти(ВРЕГ(ТекСтрокаБезнал.ТипСравнения),"СПИСКЕ")>0 Тогда
				//ИА_20160304
				СформироватьСписокЗначенийПараметра(ВидДохода, НоваяСтрока.Параметр, ТекСтрокаБезнал.Значение,КлючСписка, НоваяСтрока.ТипОплаты);
				НоваяСтрока.КлючСписка	= КлючСписка;
			КонецЕсли;
			НоваяСтрока.ТипСравнения    = ТекСтрокаБезнал.ТипСравнения;
		КонецЕсли;
		НоваяСтрока.Значение 		    = ТекСтрокаБезнал.Значение;
		
	КонецЦикла;
	
	Для каждого ТекСтрокаНал из Результат.ПараметрыЗапросаНал Цикл
		
		КлючСписка = КлючСписка + 1;
		НоваяСтрока = Объект.ПараметрыВыраженияЗапроса.Добавить();
		НоваяСтрока.ВидДохода  = ВидДохода;
		НоваяСтрока.ТипОплаты  = ПредопределенноеЗначение("Перечисление.ИА_ТипДвиженияДенежныхСредств.Наличные");
		НоваяСтрока.ВидПолученияДанных = ВидПолученияДанных;
		НоваяСтрока.Параметр           = ТекСтрокаНал.Параметр;
		
		Если НЕ ТекущаяСтрокаДоходов.ВидПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос") Тогда	
			Если Найти(ВРЕГ(ТекСтрокаНал.ТипСравнения),"СПИСКЕ")>0 Тогда
				//ИА_20160304
				СформироватьСписокЗначенийПараметра(ВидДохода, НоваяСтрока.Параметр, ТекСтрокаНал.Значение,КлючСписка, НоваяСтрока.ТипОплаты);
				НоваяСтрока.КлючСписка	= КлючСписка;
			КонецЕсли;                   			
			НоваяСтрока.ТипСравнения    = ТекСтрокаНал.ТипСравнения;  
		КонецЕсли;
		НоваяСтрока.Значение 		= ТекСтрокаНал.Значение;
		
	КонецЦикла;
	
	//ИА_20160304
	Для Каждого Стр Из Объект.СпискиЗначенийПараметров Цикл
		Если Не ЗначениеЗаполнено(Стр.ТипОплаты) Тогда
			Стр.ТипОплаты = ПредопределенноеЗначение("Перечисление.ИА_ТипДвиженияДенежныхСредств.Безналичные");
		КонецЕсли;
	КонецЦикла;
	СвернутьПараметрыСписков();
		
	
КонецПроцедуры

&НаСервере
Процедура СвернутьПараметрыСписков()
	
	ТЗ = Объект.СпискиЗначенийПараметров.Выгрузить();
	ТЗ.Свернуть("ВидДохода,ТипОплаты,ВидПолученияДанных,Параметр,Значение,КлючСписка");
	Объект.СпискиЗначенийПараметров.Загрузить(ТЗ);
	
КонецПроцедуры // СбросНастроекОтборов()




&НаКлиенте
Функция  ОпределитьТипСравнения(ТипСравненияПоСтроке)
	
	Результат = ВидСравнения.Равно;
	
	Если ТипСравненияПоСтроке = "В списке" Тогда  		
		Результат = ВидСравнения.ВСписке;
	ИначеЕсли ТипСравненияПоСтроке = "Не в списке" Тогда
		Результат = ВидСравнения.НеВСписке;
	Иначе
		
		Если ТипСравненияПоСтроке = "Не равно" Тогда
			Результат = ВидСравнения.НеРавно;                     
		ИначеЕсли ТипСравненияПоСтроке = "В группе" Тогда
			Результат = ВидСравнения.ВИерархии;
		ИначеЕсли ТипСравненияПоСтроке = "Не в группе" Тогда
			Результат = ВидСравнения.НеВИерархии;
		ИначеЕсли ТипСравненияПоСтроке = "Меньше или равно" Тогда
			Результат = ВидСравнения.МеньшеИлиРавно;
		ИначеЕсли ТипСравненияПоСтроке = "Меньше" Тогда
			Результат = ВидСравнения.Меньше;
		ИначеЕсли ТипСравненияПоСтроке = "Больше или равно" Тогда
			Результат = ВидСравнения.БольшеИлиРавно;
		ИначеЕсли ТипСравненияПоСтроке = "Больше" Тогда
			Результат = ВидСравнения.Больше;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //  ОпределитьТипСравнения()

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Ф = ПолучитьФорму("Документ.удалить_ИА_НастройкаФП.Форма.ФормаВыбораИсточника");
	Рез = Ф.ОткрытьМодально();
	Если Рез = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИсточникДанных = Рез.Имя;
	
	УстановитьНастройкиОтборов();
	
	СбросЗначенийПолей();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьНастройкиОтборов()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.УстановитьНастройкиКомпоновщика(КомпоновщикНастроек);
	
КонецПроцедуры // СбросНастроекОтборов()


&НаКлиенте
Процедура ОчиститьИсточники()

	Объект.ИсточникКонтрагент = "";
	Объект.ИсточникСтатья = "";
	Объект.ИсточникСумма = "";	

КонецПроцедуры // ОчиститьИсточники()
 

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруТиповДанных(Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Источник323.*
					|ИЗ
					|	" + Источник + " КАК Источник323";
					
	тз = Запрос.Выполнить().Выгрузить();
	
	Струк = Новый Структура("Контрагент, Статья, Сумма, Дата",);
	масКонтрагент = Новый Массив;
	масСтатья = Новый Массив;
	масСумма = Новый Массив;
	масДата = Новый Массив;
	Для каждого колонка Из тз.Колонки Цикл
	
		Если Колонка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
			масКонтрагент.Добавить(Колонка.Имя);
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств")) Тогда
			масСтатья.Добавить(Колонка.Имя);
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			масСумма.Добавить(Колонка.Имя);
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
			масСумма.Добавить(Колонка.Имя);
		КонецЕсли;	
	
	КонецЦикла; 
	
	Струк.Вставить("Контрагент", масКонтрагент);
	Струк.Вставить("Статья", масСтатья);
	Струк.Вставить("Сумма", масСумма);
	Струк.Вставить("Дата", масДата);
	
	Возврат Струк;
	
КонецФункции // ПолучитьСтруктуруТиповДанных()

&НаКлиенте
Процедура ИсточникКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура;	
	Парам.Вставить("ИсточникПолей", Объект.ИсточникДанных);
	Рез = ОткрытьФормуМодально("Документ.удалить_ИА_НастройкаФП.Форма.ФормаВыбораИсточника", Парам);
	Если Рез = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИсточникКонтрагент = Рез.Имя;
	
	Если Рез.Тип.Типы().Найти(Тип("СправочникСсылка.Контрагенты")) = Неопределено Тогда
		Объект.ИсточникКонтрагент = "";
		ПоказатьПредупреждение(,"Неверно выбрано поле контрагента",,);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура;	
	Парам.Вставить("ИсточникПолей", Объект.ИсточникДанных);
	Рез = ОткрытьФормуМодально("Документ.удалить_ИА_НастройкаФП.Форма.ФормаВыбораИсточника", Парам);
	Если Рез = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИсточникСтатья = Рез.Имя;
	
	Если Рез.Тип.Типы().Найти(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств")) = Неопределено Тогда
		Объект.ИсточникСтатья = "";
		ПоказатьПредупреждение(,"Неверно выбрано поле статьи движения денежных средств",,);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСуммаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура;	
	Парам.Вставить("ИсточникПолей", Объект.ИсточникДанных);
	Рез = ОткрытьФормуМодально("Документ.удалить_ИА_НастройкаФП.Форма.ФормаВыбораИсточника", Парам);
	Если Рез = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИсточникСумма = Рез.Имя;
	
	Если Рез.Тип.Типы().Найти(Тип("Число")) = Неопределено Тогда
		Объект.ИсточникСумма = "";
		ПоказатьПредупреждение(,"Неверно выбрано поле суммы",,);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура;	
	Парам.Вставить("ИсточникПолей", Объект.ИсточникДанных);
	Рез = ОткрытьФормуМодально("Документ.удалить_ИА_НастройкаФП.Форма.ФормаВыбораИсточника", Парам);
	Если Рез = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИсточникДата = Рез.Имя;
	
	Если Рез.Тип.Типы().Найти(Тип("Дата")) = Неопределено Тогда
		Объект.ИсточникДата = "";
		ПоказатьПредупреждение(,"Неверно выбрано поле даты",,);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки() 

	//Настройки = КомпоновщикНастроек.Настройки;
	//НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	//Путь = ПолучитьИмяВременногоФайла("xml");
	//Запись = Новый ЗаписьXML;
	//Запись.ОткрытьФайл(Путь);
	//Запись.ЗаписатьОбъявлениеXML();
	//НовыйСXDTO.ЗаписатьXML(Запись, Настройки, НазначениеТипаXML.Явное, ФормаXML.Элемент);
	//Запись.Закрыть();
	//
	//ЧТ = Новый ЧтениеТекста(Путь); 
	//Объект.ИсточникНастройкаОтбора = ЧТ.Прочитать();

КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПроверкаЗаполненияПолей() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияПолей()

	Если ЗначениеЗаполнено(Объект.ИсточникДанных) И 
		Не ЗначениеЗаполнено(Объект.ИсточникСумма) Тогда
		//(Не ЗначениеЗаполнено(Объект.ИсточникКонтрагент)
		//	Или Не ЗначениеЗаполнено(Объект.ИсточникСтатья)
		//	Или Не ЗначениеЗаполнено(Объект.ИсточникСумма)) Тогда
			ПоказатьПредупреждение(,"Не заполнено поле Суммы для источника",, "Ошибка заполнения полей");
			Возврат Ложь;
	КонецЕсли; 	
	
	Возврат Истина;

КонецФункции // ПроверкаЗаполненияПолей()
 

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ИсточникКонтрагент.Доступность = ЗначениеЗаполнено(Объект.ИсточникДанных);
	Элементы.ИсточникСтатья.Доступность = ЗначениеЗаполнено(Объект.ИсточникДанных);
	Элементы.ИсточникСумма.Доступность = ЗначениеЗаполнено(Объект.ИсточникДанных);
	Элементы.КомпоновщикНастроекНастройкиОтбор.Доступность = ЗначениеЗаполнено(Объект.ИсточникДанных);
	
КонецПроцедуры // УстановитьДоступностьЭлементов()

&НаКлиенте
Процедура СбросЗначенийПолей()
	
	Объект.ИсточникКонтрагент = "";
	Объект.ИсточникСтатья = "";
	Объект.ИсточникСумма = ""; 	
		
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	СбросЗначенийПолей();
	УстановитьДоступностьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ИсточникКонтрагентПриИзменении(Элемент)
	Структура = ПолучитьСтруктуруТиповДанных(Объект.ИсточникДанных);
	ЕстьТакойЭлемент = Ложь;
	Для каждого с из Структура.Контрагент Цикл
		Если Объект.ИсточникКонтрагент = с Тогда
			ЕстьТакойЭлемент = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Не ЕстьТакойЭлемент Тогда
		Объект.ИсточникКонтрагент = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСтатьяПриИзменении(Элемент)
	Структура = ПолучитьСтруктуруТиповДанных(Объект.ИсточникДанных);
	ЕстьТакойЭлемент = Ложь;
	Для каждого с из Структура.Статья Цикл
		Если Объект.ИсточникСтатья = с Тогда
			ЕстьТакойЭлемент = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Не ЕстьТакойЭлемент Тогда
		Объект.ИсточникСтатья = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСуммаПриИзменении(Элемент)
	Структура = ПолучитьСтруктуруТиповДанных(Объект.ИсточникДанных);
	ЕстьТакойЭлемент = Ложь;
	Для каждого с из Структура.Сумма Цикл
		Если Объект.ИсточникСумма = с Тогда
			ЕстьТакойЭлемент = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Не ЕстьТакойЭлемент Тогда
		Объект.ИсточникСумма = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДатаПриИзменении(Элемент)
	Структура = ПолучитьСтруктуруТиповДанных(Объект.ИсточникДанных);
	ЕстьТакойЭлемент = Ложь;
	Для каждого с из Структура.Дата Цикл
		Если Объект.ИсточникДата = с Тогда
			ЕстьТакойЭлемент = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Не ЕстьТакойЭлемент Тогда
		Объект.ИсточникДата = "";
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазбитьСтрокуНаМассив(Знач ИсходнаяСтрока, Разделитель)
	
	мас = Новый Массив;
	НачНомер = 1;
	Позиция = 1;
	Если Найти(ИсходнаяСтрока, Разделитель) = 0 Тогда
		мас.Добавить(ИсходнаяСтрока);
		Возврат мас;
	КонецЕсли;
	
	Пока Истина Цикл
		Позиция = Найти(ИсходнаяСтрока, Разделитель);
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;	
		НовСтр = Сред(ИсходнаяСтрока, НачНомер, Позиция-1);
		мас.Добавить(СокрЛП(НовСтр));
		ИсходнаяСтрока = Прав(ИсходнаяСтрока, СтрДлина(ИсходнаяСтрока) - Позиция);
		
	КонецЦикла; 	
	
	Возврат мас;
	
КонецФункции // РазбитьСтрокуНаМассив()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	//
	Объект.Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.Организация);
	//
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Настройки = КомпоновщикНастроек.Настройки;
	ТекущийОбъект.ИА_НастройкаОтбораХранилище = Новый ХранилищеЗначения(Настройки);
КонецПроцедуры
